app/controllers/user_controller.rb

  def register_user
    password = Digest::MD5.hexdigest(params[:user][:password])
    params[:user].merge!(:password=>password)
    user_params = params.require(:user).permit(:email_id,:password)
    User.create(user_params)
---
INSERT INTO "users" ("created_at", "email_id", "password", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-09-25 13:19:55.957337"], ["email_id", "vijayakumar@kreatio.com"], ["password", "202cb962ac59075b964b07152d234b70"], ["updated_at", "2014-09-25 13:19:55.957337"]]

  def login
    email = params[:user][:email_id]
    pwd = params[:user][:password]
    password = Digest::MD5.hexdigest(pwd)
    @user = User.where("email_id = ? and password = ?",email,password).first
---
SELECT  "users".* FROM "users"  WHERE (email_id = 'vijayakumar@kreatio.com' and password = '202cb962ac59075b964b07152d234b70')  ORDER BY "users"."id" ASC LIMIT 1